Repository: wp-plugins/jm-last-twit-shortcode
Catalog: languages/jm-ltsc-*.po
Languages: fr_fr

source: About the developer
fr_fr: A propos du developpeur

source: Basic use, no option => whether it is in a post or in a Text widget use: <code>[jmlt]</code>
fr_fr: Utilisation basique sans option : que ce soit dans un post ou un widget text utilisez: <code>[jmlt]</code>

source: Class tmhOAuth is already running in your website, this could break the plugin JMLTSC !
fr_fr: La classe tmhOAuth est déjà utilisée sur le site, cela peut engendrer d'importants conflits avec le plugin JMLTSC!

source: Different username => whether it is in a post or in a Text widget use: <code>[jmlt username="rihanna"]</code>
fr_fr: Autre nom d'utilisateur, autre timeline =>que ce soit dans un post ou un widget text utlisez: <code>[jmlt username="rihanna"]</code>

source: Exclude RTs => whether it is in a post or in a Text widget use: <code>[jmlt include_rts="false"]</code>
fr_fr: Exclure les RTs => que ce soit dans un post ou un widget text utlisez: <code>[jmlt include_rts="false"]</code>

source: Exclude replies => whether it is in a post or in a Text widget use: <code>[jmlt exclude_replies="true"]</code>
fr_fr: Exclure les réponses => que ce soit dans un post ou un widget text utlisez: <code>[jmlt exclude_replies="true"]</code>

source: Favorite
fr_fr: Favori

source: Fix poor native markup for WordPress gallery with some HTML5 markup and add responsive rules.
fr_fr: Corrige le markup native assez pauvre de WordPress concernant les galeries avec un peu d'HMTL5 et quelques règles CSS responsive.

source: Get your last tweets <br />the Twitter 1.1 way</br> with a simple shortcode
fr_fr: Afficher vos derniers tweets <br />selon l'API Twitter 1.1</br> avec un simple shortcode

source: Help me keep this free
fr_fr: Restons gratuit

source: How to
fr_fr: Comment utiliser le shortcode

source: I am a WordPress Developer, I like to make it simple.
fr_fr: Je suis développeur WordPress, j'aime faire simple.

source: Make your comments tweetable
fr_fr: Ajoutez un lien twitter sur chacun de vos commentaires

source: More than 1 tweet, e.g 5 => whether it is in a post or in a Text widget use: <code>[jmlt count="5"]</code>
fr_fr: Plus d' 1 tweet, ex : 5 => que ce soit dans un post ou un widget text utilisez: <code>[jmlt count="5"]</code>

source: My WordPress Profile
fr_fr: Mon profil WordPress

source: Other plugins you might dig
fr_fr: D'autres plugins que vous pourriez aimer

source: Plugin displays tweets in an unordered list you can style in your own stylesheet with CSS classes <code>tweet-name {}</code>, <code>.tweet-screen-name {}</code>, <code>.tweet-twittar {}</code>, <code>.tweet-timestamp{}</code>, <code>.time-date{}</code>, <code>.tweet-timediff{}</code>, <code>.intent-meta{}</code>, <code>.tweet-reply{}</code>, <code>.tweet-retweet{}</code>, <code>.tweet-favorite{}</code>. <br />To apply styles to the text of you tweets just us CSS class <code>.tweet-content{}</code>
fr_fr: Le plugin affiche les tweets dans une liste non ordonnée que vous pouvez styler dans votre propre CSS avec les classes suivantes <code>tweet-name {}</code>, <code>.tweet-screen-name {}</code>, <code>.tweet-twittar {}</code>, <code>.tweet-timestamp{}</code>, <code>.time-date{}</code>, <code>.tweet-timediff{}</code>, <code>.intent-meta{}</code>, <code>.tweet-reply{}</code>, <code>.tweet-retweet{}</code>, <code>.tweet-favorite{}</code>. <br />Pour les styles spécifiques au texte des tweets utilisez <code>.tweet-content{}</code>

source: Provide your Twitter username (used by default and without @)
fr_fr: Entrez votre compte Twitter (utilisé par défaut et sans @)

source: Provide your application consumer key
fr_fr: Entrez la consumer key de votre application

source: Provide your application consumer secret
fr_fr: Entrez la consumer secret de votre application

source: Provide your oAuth Token
fr_fr: Entrez l'oAuth Token de votre application

source: Provide your oAuth Token Secret
fr_fr: Entrez l'oAuth Token Secret de votre application

source: Rate limits are exceed!
fr_fr: Les quotas Twitter sont dépassés !

source: Rate the plugin on WordPress.org
fr_fr: Donner un 5 étoile au plugin sur WordPress.org

source: Reply
fr_fr: Répondre

source: Retweet
fr_fr: Retweeter

source: Set cache duration => whether it is in a post or in a Text widget use: <code>[jmlt cache="3600"]</code> to put tweets in cache for 1 hour
fr_fr: Définir la durée du cache => que ce soit dans un post ou un widget text utlisez: <code>[jmlt cache="3600"]</code>pour mettre les tweets en cache pour 1 heure

source: Something is wrong or missing.
fr_fr: Quelque chose ne va pas et sort du cadre d'identification du plugin JMLTSC

source: To grab your feed you need to authenticate in the new version of Twitter API 1.1
fr_fr: Pour affichez votre flux Twitter vous devez vous authentifier dans la version 1.1 de l'API Twitter

source: To reuse tokens you set to use the plugin => just write in your templates and codes :<code>global $tcTmhOAuth;</code>
fr_fr: Pour réutiliser les identifiants créés pour utiliser le plugin => écrivez dans vos templates et codes:<code>global $tcTmhOAuth;</code>

source: Tweet it
fr_fr: Tweeter

source: Twitter is overwhelmed or something bad happened with its API.
fr_fr: Twitter est totalement dépassé et en surcapacité, l'API a subi un crash important.

source: Useful links
fr_fr: Liens utiles

source: With this plugin you can display any Twitter timeline with a simple a shortcode
fr_fr: Avec ce plugin vous pouvez afficher n'importe quelle timeline Twittter avec un simple shortcode

source: Your credentials might be unset or incorrect or username is wrong. In any case this error is not due to Twitter API.
fr_fr: Vos identifiants n'ont pas été fournis ou sont incorrects ou alors le nom d'utilisateur est incorrect. En tous cas cela ne vient pas de Twitter.

source: follow me on Twitter
fr_fr: me suivre sur Twitter

source: https://twitter.com/intent/tweet?source=webclient&amp;hastags=WordPress,Plugin&amp;text=JM%20Last%20Twit%20%20Shortcode%20a%20great%20WordPress%20plugin%20to%20get%20your%20last%20tweet%20Try%20it!&amp;url=http://wordpress.org/extend/plugins/jm-last-twit-shortcode/&amp;related=TweetPressFr&amp;via=TweetPressFr
fr_fr: https://twitter.com/intent/tweet?source=webclient&amp;hastags=WordPress,Plugin&amp;text=JM%20Last%20Twit%20%20Shortcode%20est%20un%excellent%20plugin%20WordPress%20pour%20afficher%20des%20timelines%20Twitter%20essayez-le!&amp;url=http://wordpress.org/extend/plugins/jm-last-twit-shortcode/&amp;related=TweetPressFr&amp;via=TweetPressFr

source: on Twitter
fr_fr: sur Twitter

source: Do you want to add Quicktags (buttons in HTML editor) in post edit?
fr_fr: Voulez-vous ajouter les QuickTags (boutons dans l'éditeur HTML) dans vos édits de posts?

source: Default is yes
fr_fr: Oui par défaut

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Delete cache
fr_fr: Effacer le cache

source: Delete cache now!
fr_fr: Vider le cache maintenant!

source: Cache has been deleted.
fr_fr: Le cache a bien été vidé.

source: Twitter account (without @)
fr_fr: Votre compte Twitter (sans @)

source: Insert Twitter Shortcode
fr_fr: Insérer le shortcode Twitter

source: How many Tweets?
fr_fr: Combien de tweets?

source: Cache duration (hours)
fr_fr: Durée du cache (heures)

source: Include RTs?
fr_fr: Inclure les RTs?

source: Exclude replies?
fr_fr: Exclure les réponses

source: Size of Twittar?
fr_fr: Taille du Twittar?

source: Display attached pic?
fr_fr: Afficher l'image associée au tweet?
